{
  "bacon": {
    "description": "Just saying \"Bacon\" etc.",
    "rules": "Steak, chicken, any single word comment involving the flesh of our non human family.",
    "main": [
      "This can occur in any number of situations, on a web social thread, in a conversation about food, over dinner etc.",
      "Often not a lot of thought goes into humour at the expense of animals, so we cannot get too carried away with analysing, but...",
      "In Internet terms this could be called a Troll, someone deliberately saying something offensive because they think they are being clever, despite the fact it has little more intelligence or humour in it other than being offensive.",
      "In deeper terms this could be called a cold joke, trying to paint something as humorous to themselves in order to avoid dealing with the psychological ramifications of the immoral action they are knowingly participating in.",
      "Bacon, steak, chicken, they are all animals killed for enjoyment, the least people who pay for that to happen can do is have some respect for them."
    ]
  },
  "hitler": {
    "description": "Hitler was a vegetarian",
    "rules": "Pol Pot, Charles Manson, anyone who reflects poorly on our species",
    "main": [
      "Evil people who might have eaten vegetables at one point in their lives are often trudged out as examples of...well it is hard to say. What it is probably about is the person trying to maintain their own sense of self esteem by slanderously associating anyone who may be making a moral choice with evil people from history.",
      "They probably know they are participating in something immoral, and rather than taking any action to be a better person, are using whatever they can grab on to to drag other people down.\nHitler, Pol Pot, neither were ethical vegetarians, they did so for short periods due to health problems and Hitler certainly would rather be eating his favourite sausages.",
      "The Nazis did enact some laws against animal cruelty, they also had the Winter Relief programme helping the poor during the cold months, so they were evil but not every single thing they did necessarily was.",
      "Ultimately veganism is about compassion for animals; humans are animals so we care about them too."
    ]
  },
  "protein": {
    "description": "Where do you get your protein?",
    "rules": "Iron. B12 is not, because vegans do need to take care to supplement this essential vitamin.",
    "main": [
      "Where did people get their obsession with asking about protein? Probably meat and dairy industry propaganda which reaches far more people than any unbiased nutritional advice.",
      "There has never been any study which has shown protein deficiency in people following a plant based diet. Protein deficiency is unknown in any population who eats enough calories.",
      "Of course they also rarely know how much protein they need themselves so let's help them out. Your weight in kilograms times 0.8 to 1.8 grams depending on how much weight bearing or endurance exercise you do."
    ]
  },
  "cheese": {
    "description": "I could never give up cheese",
    "rules": "You are not going to need any other answers because you will be hearing this one repeatedly.",
    "main": [
      "The second part of the statement I could never give up cheese should be - no matter how much cruelty is involved.",
      "Hopefully this is simply untrue though, that instead people can be motivated by rational and ethical concerns. If people understood that it wasn't a particularly healthy thing to eat, contributes to the veal trade in young calves, is environmentally polluting and unhealthy for the cows themselves, hopefully they could find the motivation to replace just one of the hundreds or thousands of ingredients in their diet.",
      "There are mock cheeses, personally I don't think they are the best of our vegan substitutes, but others like them. In the end I relate a quote from someone who said, I couldn't give up cheese, so instead I gave up cruelty."
    ]
  },
  "cow": {
    "description": "What would happen to the cows?",
    "rules": "Cows like to be milked! It shows a similar complete misunderstanding of how dairy cows are bred and for what purpose.",
    "main": [
      "Cows are not allowed to breed naturally, the idea that they are has more to do with romantic visions of the countryside and how they might once have lived in nature than intensive industrial animal farming.",
      "Their breeding is strictly controlled by the farmers and companies engineering their bodies for human purposes, such as growing oversized udders which impair their mobility. The population of livestock rises and falls quickly in relation to human demand. Veal calves for instance are mainly the by-product of cows artificially inseminated to keep their milk production high.",
      "Sadly for animals born as \"livestock\" it is unlikely that a change to a vegan world will happen overnight, it will probably be gradual. Carnists can therefore stop losing sleep over the terrible notion of these creatures living out their natural lifespans and just go vegan."
    ]
  },
  "plants": {
    "description": "Don't plants have feelings?",
    "rules": "Carrots scream when you cut them!",
    "main": [
      "Sadly people who ask this are likely to care even less about plants than they do non human animals.",
      "There is a serious point here, something which would generally elude anyone silly enough to phrase the question this way, and that is where do we draw the line of compassion towards other life?",
      "Darwin and the best biologists since have understood that our common evolutionary heritage expresses itself in us sharing much of our sentience with other beings. In understanding how we should treat other beings ethically we should discuss levels of self awareness, the ability to suffer, the presence of a central nervous system, in all of which science should be our guide.",
      "Science is confirming the evidence of our experiences, that the non human animals we share our lives with have personalities, feelings, hopes etc. We should draw a line based on our ever advancing knowledge not just at human and non human. In the end if we err in that endeavour let us err on the side of compassion."
    ]
  },
  "teeth": {
    "description": "What about our canine teeth?",
    "rules": "Meat eating caused human brains to grow.",
    "main": [
      "Human canine teeth look rather lame compared with the ones sported by our cousins the gorillas, who are either wholly vegan or some eat small insects. Indeed all primates have canine teeth used mainly for dominance displays and as weapons.",
      "It is unfortunate that the name canine has caused so much confusion, however the presence of them provides no justification for cruelty whether using them to tear the flesh of innocent animals or of our human rivals.",
      "As for meat eating helping our evolution, well it is another source of food so it may have helped in that respect, but the evidence is that it was cooking and the extra starches available in our diet that probably fuelled our brain development, though the jury is still out.",
      "Ultimately, it is our conscience not our biology that should be the main guiding wisdom of our actions."
    ]
  },
  "humane": {
    "description": "What if we raised animals humanely?",
    "rules": "What if the chickens were raised in your backyard?",
    "main": [
      "A lot of people talk about humane farming, but for all the talk few people are rigorous about doing it or supporting it with their money.",
      "Some people do try to buy some more humane animal products at home, but care little once they leave the house. Also the pure economics of the livestock industries mean inhumanity is inevitable. Evidence of this is how some countries have taken the enlightened step to ban caged hens but this has been followed quickly by a loosening of cruelty standards on free range to keep the industry profitable.",
      "To feed billions of people animal products at every meal, is always going to take an industrial system, a long way removed from the image of the country farm many people have in their minds - not that these were ever a paradise for animals either.",
      "Abuses may be less routine in backyard farming, but forced breeding, confinement and killing of other animals for our purposes is never reconcilable with the values of freedom and compassion, and certainly not with the interests of the individual victims involved."
    ]
  },
  "food": {
    "description": "Why do vegans eat things resembling animal products?",
    "rules": "Asking whether any given vegan alternative is made of tofu...which is all vegans eat apparently",
    "main": [
      "For a start, most animal products do not look like animal products. Cheese, sausages, fish fingers, they are all creations for a culinary purpose.",
      "Many vegans avoid products resembling animal foods, however others find them to be a convenient and less cruel alternative.",
      "It is oppression and violence that we oppose, not a particular ingredient's texture, shape or flavour. Remove the harmful aspects, as vegan products strive to do, and you can enjoy whatever pleases you."
    ]
  },
  "natural": {
    "description": "Meat eating is natural",
    "rules": "Making appeals that it has been done for a long time.",
    "main": [
      "As much as humans wish for a moral universe, the laws which govern it are amoral. Good things happen to bad people, terrible things happen to good people, all governed by elegant but soulless mathematical principles.",
      "To say then that something is natural and that this is alone needed as a moral defence of the action, would be to ignore the vast number of natural but terrible things that go on. Massive outbreaks of deadly disease used to be common; it is a moral act to intervene but is not purely natural.",
      "We make advances in society in fields such as law, justice, democracy, modern medicine, philosophy and the study of ethics not by appeals to what is natural but what is best.",
      "Finally to call the modern factory farming system natural, is to render the word meaningless. Freedom is the natural state every sentient being desires."
    ]
  },
  "eat": {
    "description": "What can you eat?",
    "rules": "Oh you are vegan, that must be hard.",
    "main": [
      "On becoming vegan people discover an expanded world of delicious ingredients to explore. Many people also use the process of becoming vegan to transition to a healthier diet.",
      "90% of any healthy diet is already vegan, and the other 10% we replace with nuts, seeds, beans, legumes, grains, tofu, tempeh, seitan, the ever widening variety of convenient substitute products and plant based milks, soy, almond, macadamia, oat, rice, hemp, quinoa and coconut.",
      "Being vegan is not hard, as much as people might prefer to think it is. The main thing that makes it trying sometimes is the knowledge that there aren't more of us."
    ]
  },
  "notmuch": {
    "description": "I don't each much meat",
    "rules": "Telling you they ate a vegetarian meal recently.",
    "main": [
      "This is a positive and healthy statement, but often people who assert this eat meat at almost every meal.",
      "Our ideas of what a normal diet is are culturally shaped. The fact that someone eats less meat than their unhealthy friend, or chooses fish or chicken instead of red meat, does not equate to not eating much meat.",
      "The average person eats much more meat than is considered healthy. Per capita animal product consumption has risen far above even recent historical levels in many countries.",
      "If someone has more days vegetarian than otherwise, then they might be able to claim to be not eating much meat, otherwise they are probably eating more than they should.",
      "Obviously for the animals who live and die in agribusiness systems before ending up on a dinner plate, the optimal amount would be zero."
    ]
  },
  "what": {
    "description": "What about people?",
    "rules": "Some people care more about animals than they do people.",
    "main": [
      "The premise of this statement is that whilst there is human suffering, we shouldn't concern ourselves with the suffering of other animals. Vegans don't believe that such a choice needs to be made and care about the suffering of all animals, humans included.",
      "Indeed they are often related: caring for the environment benefits all who share the earth, teaching compassion helps all who can suffer, switching to a plant based diet is going to allow more food for people to be grown with less land used providing habitat for other animals.",
      "The idea that humans are in a different sphere to all other animals is a pre darwinian conception of ourselves, scientific secular understanding informs us that we are relatives in the same family tree who share traits.",
      "All who can suffer deserve consideration, of primary relevance to own conscience should be those who suffer as a direct consequence of how we choose to live.",
      "As many philosophers have said, ethics is like a muscle that goes stronger with use. We should be encouraging compassion in all spheres of life.",
      "Withdrawing our support and consent to the unnecessary suffering of animals is ultimately going to benefit our fellow humans as well."
    ]
  },
  "cant": {
    "description": "Oh, you can't eat that.",
    "rules": "Some ridiculous thing they think isn't vegan. I've had avocado and cotton - see how you go.",
    "main": [
      "It is interesting that people frame our avoidance of animal products with the word - can't - as if it were not voluntary, rather than - won't - which reflects a conscious choice.",
      "Vegans can eat whatever they want, they actively choose not to eat certain products out of concern for the animals involved. Even carnists often refuse to eat some species such as whale, rat or dog, not because they can't but on the basis of habit, cultural or ethical norms.",
      "Vegans take that ethical stance to it's logical conclusion. We make active choices based on our principles."
    ]
  },
  "aspirational": {
    "description": "I'd like to be vegan, but...",
    "rules": "I was vegan/vegetarian but...",
    "main": [
      "The more mainstream veganism becomes and the more society understands the multitude of reasons for living vegan, the more we hear this. It's a sign that veganism has arrived.",
      "Of course as vegans we know it's easy to be vegan in most places, and we can get by in most others with a bag of nuts, some bread and a decent salad. Why people don't make the transition has more to do with habit and conformity than anything else.",
      "Each time a person says this is a chance to help them achieve an aspiration for themselves. Gently gently, we might start by showing them all the free online resources to help them, the local shops or restaurants stocking vegan products, and probably the most convincing advocacy: introducing them to delicious vegan food.",
      "For people who used to be vegetarian or vegan, it's often the case that they return to it when their mindset and life is in the right place. Helping people who are already aware of the need for change is one of the most fruitful forms of activism."
    ]
  },
  "preachy": {
    "description": "Vegans are preachy",
    "rules": "Each to their own or the sadly ironic live and let live.",
    "main": [
      "OK, there are some preachy vegans who need to chill out, but as vegans reflect the diversity of people generally there isn't a stereotype. Anyone who has had bad experiences with a preachy vegan though should try being vegan for a while and see how the reverse is also true.",
      "This comes down to people's idea of what life is all about, some think it is just about being popular and conforming, and they can't understand people who would expend their social capital advocating ethical beliefs. They might even express this point of view in cliches such as 'to each their own' or 'live and let live'. But as frustrating as we might find this, getting upset with someone is likely to be counter-productive.",
      "We can speak the best for animals by engaging peoples compassion rather than their self defensiveness. Positive people living in alignment with their ideals are the best advocates for veganism."
    ]
  }
}
